# Coding Practice Session 5
## Advanced Data Selection in Pandas

In [39]:
import string

import pandas as pd
import numpy as np

### Boolean Indexing

In [4]:
s = pd.Series([1, 2, 3, 4, 5], index=list("abcde"))
s >= 3

a    False
b    False
c     True
d     True
e     True
dtype: bool

In [5]:
s[s >= 3]

c    3
d    4
e    5
dtype: int64

In [ ]:
df = pd.DataFrame(
    np.random.randint(-10, 10, size=(5, 3)),
    columns=["A", "B", "C"],
    index=list("abcde"),
)

df

   A   B   C
a -3  -9   5
b -7  -1   7
c -6 -10  -9
d  7  -4 -10
e -1  -5   2

In [ ]:
df > 0

       A      B      C
a  False  False   True
b  False  False   True
c  False  False  False
d   True  False  False
e  False  False   True

In [9]:
df[df > 0]

     A   B    C
a  NaN NaN  5.0
b  NaN NaN  7.0
c  NaN NaN  NaN
d  7.0 NaN  NaN
e  NaN NaN  2.0

In [10]:
df["C"] > 0

a     True
b     True
c    False
d    False
e     True
Name: C, dtype: bool

In [11]:
df[df["C"] > 0]

   A  B  C
a -3 -9  5
b -7 -1  7
e -1 -5  2

In [14]:
mask = df.mean() > -5
mask

A     True
B    False
C     True
dtype: bool

In [16]:
df.loc[:, mask]

   A   C
a -3   5
b -7   7
c -6  -9
d  7 -10
e -1   2

In [17]:
df.loc[df["A"] > -5, mask]

   A   C
a -3   5
d  7 -10
e -1   2

In [18]:
df

   A   B   C
a -3  -9   5
b -7  -1   7
c -6 -10  -9
d  7  -4 -10
e -1  -5   2

In [19]:
df[(df["A"] > -5) | (df["B"] > -8)]

   A  B   C
a -3 -9   5
b -7 -1   7
d  7 -4 -10
e -1 -5   2

In [20]:
df[(df["A"] > -5) & (df["B"] > -8)]

   A  B   C
d  7 -4 -10
e -1 -5   2

In [21]:
df.mean()

A   -2.0
B   -5.8
C   -1.0
dtype: float64

In [23]:
df[~(df["C"] > df["A"].mean())]

   A   B   C
c -6 -10  -9
d  7  -4 -10

In [24]:
df[df["A"] > df["A"].mean()]

   A  B   C
d  7 -4 -10
e -1 -5   2

In [26]:
df[df["C"] <= df["C"].mean()]

   A   B   C
c -6 -10  -9
d  7  -4 -10

### Indexing with `isin`

In [27]:
df = pd.DataFrame({"A": [10, 20, 30, 40, 50], "B": tuple("abcde")})

In [28]:
df

    A  B
0  10  a
1  20  b
2  30  c
3  40  d
4  50  e

In [29]:
df["A"].isin([20, 50])

0    False
1     True
2    False
3    False
4     True
Name: A, dtype: bool

In [30]:
df[df["A"].isin([20, 50])]

    A  B
1  20  b
4  50  e

In [32]:
values_to_exclude = ["a", "d"]
~df["B"].isin(values_to_exclude)

0    False
1     True
2     True
3    False
4     True
Name: B, dtype: bool

In [33]:
df[~df["B"].isin(["a", "d"])]

    A  B
1  20  b
2  30  c
4  50  e

In [34]:
df

    A  B
0  10  a
1  20  b
2  30  c
3  40  d
4  50  e

In [38]:
df[(df["A"].isin([20, 30])) | (df["B"].isin(["b", "e"]))]

    A  B
1  20  b
2  30  c
4  50  e

### Indexing with `query`

In [42]:
df = pd.DataFrame(
    {
        "A": [10, 20, 30, 40, 50],
        "B": np.random.randint(100, 120, size=5),
        "C": np.random.choice(list(string.ascii_lowercase), size=5),
    }
)

df

    A    B  C
0  10  106  q
1  20  108  a
2  30  113  x
3  40  101  p
4  50  106  y

In [44]:
df.query("B > 106")

    A    B  C
1  20  108  a
2  30  113  x

In [46]:
df.query("B > 105 & A < 40")

    A    B  C
0  10  106  q
1  20  108  a
2  30  113  x

In [49]:
valid_char = "y"

df.query("B > 105 & A < 40 | C == @valid_char")

    A    B  C
0  10  106  q
1  20  108  a
2  30  113  x
4  50  106  y

In [50]:
df.query("A ** 2 > 450")

    A    B  C
2  30  113  x
3  40  101  p
4  50  106  y

In [51]:
df.query("C.str.startswith('x')")

    A    B  C
2  30  113  x

In [52]:
threshold = 25
df.query("A > @threshold")

    A    B  C
2  30  113  x
3  40  101  p
4  50  106  y

### Indexing with `where`

In [53]:
s = pd.Series([1, 2, 3, 4, 5], index=list("abcde"))
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [54]:
s.where(s > 2)

a    NaN
b    NaN
c    3.0
d    4.0
e    5.0
dtype: float64

In [57]:
s.where(s < 3, 100)

a      1
b      2
c    100
d    100
e    100
dtype: int64

In [58]:
df

    A    B  C
0  10  106  q
1  20  108  a
2  30  113  x
3  40  101  p
4  50  106  y

In [61]:
df.where(df["A"] > 30, other="Invalid")

         A        B        C
0  Invalid  Invalid  Invalid
1  Invalid  Invalid  Invalid
2  Invalid  Invalid  Invalid
3       40      101        p
4       50      106        y

In [64]:
df.where(df["A"] > 30, other=df["C"], axis=0)

    A    B  C
0   q    q  q
1   a    a  a
2   x    x  x
3  40  101  p
4  50  106  y

In [ ]:
df.loc[df["A"] > df["A"].mean(), "C"].where(
    lambda x: ~x.isin(["x", "y", "z"]), other="Invalid"
)

3          p
4    Invalid
Name: C, dtype: object

### Exercise

In [ ]:
# 1
df = pd.DataFrame(
    {"A": [1, 8, 3, 10, 5], "B": [5, 12, 7, 8, 9], "C": ["a", "b", "c", "d", "e"]}
)
df

    A   B  C
0   1   5  a
1   8  12  b
2   3   7  c
3  10   8  d
4   5   9  e

In [71]:
df[(df["A"] > 5) & (df["B"] < 10)]

    A  B  C
3  10  8  d

In [72]:
df.query("A > 5 & B < 10")

    A  B  C
3  10  8  d

In [74]:
# 2
df = pd.DataFrame(
    {"Category": ["A", "B", "C", "A", "D", "C"], "Value": [10, 20, 30, 40, 50, 60]}
)
df

  Category  Value
0        A     10
1        B     20
2        C     30
3        A     40
4        D     50
5        C     60

In [76]:
mask = df["Category"].isin(["A", "C"])
mask

0     True
1    False
2     True
3     True
4    False
5     True
Name: Category, dtype: bool

In [77]:
df[mask]

  Category  Value
0        A     10
2        C     30
3        A     40
5        C     60

In [ ]:
# 3
df = pd.DataFrame({"Price": [40, 60, 80, 100], "Quantity": [50, 80, 120, 90]})
df

   Price  Quantity
0     40        50
1     60        80
2     80       120
3    100        90

In [79]:
df.query("Price > 50 & Quantity < 100")

   Price  Quantity
1     60        80
3    100        90

In [83]:
mask = (df["Price"] > 50) & (df["Quantity"] < 100)
mask

0    False
1     True
2    False
3     True
dtype: bool

In [84]:
df[mask]

   Price  Quantity
1     60        80
3    100        90

In [109]:
# 4
df = pd.DataFrame({"Score": [85, 92, 78, 95], "Grade": ""})
df

   Score Grade
0     85
1     92
2     78
3     95

In [110]:
df["Grade"].where(df["Score"] <= 90, other="A")

0
1    A
2
3    A
Name: Grade, dtype: object

In [111]:
df["Grade"] = df["Grade"].where(df["Score"] <= 90, other="A")
df

   Score Grade
0     85
1     92     A
2     78
3     95     A

In [115]:
df["Grade"].where((df["Score"] <= 80) | (df["Score"] > 90), other="B")

0    B
1    A
2
3    A
Name: Grade, dtype: object

In [116]:
df["Grade"] = df["Grade"].where((df["Score"] <= 80) | (df["Score"] > 90), other="B")
df

   Score Grade
0     85     B
1     92     A
2     78
3     95     A

In [117]:
df["Grade"].where(df["Score"] > 80, other="C")

0    B
1    A
2    C
3    A
Name: Grade, dtype: object

In [118]:
df["Grade"] = df["Grade"].where(df["Score"] > 80, other="C")
df

   Score Grade
0     85     B
1     92     A
2     78     C
3     95     A